{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "MyLayer", "config": {"name": "my_layer_1", "trainable": true, "num_layers": 32, "filter_shape": 3}}, {"class_name": "MyLayerRelu", "config": {"name": "my_layer_relu_1", "trainable": true}}, {"class_name": "MyLayer", "config": {"name": "my_layer_2", "trainable": true, "num_layers": 64, "filter_shape": 3}}, {"class_name": "MyLayerMaxPool", "config": {"name": "my_layer_max_pool_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "MyLayerRelu", "config": {"name": "my_layer_relu_2", "trainable": true}}, {"class_name": "MyLayerDropout", "config": {"name": "my_layer_dropout_1", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": 0}}, {"class_name": "MyFlatten", "config": {"name": "my_flatten_1", "trainable": true}}, {"class_name": "MyLayerDense", "config": {"name": "my_layer_dense_1", "trainable": true, "output_dim": 128}}, {"class_name": "MyLayerDenseRelu", "config": {"name": "my_layer_dense_relu_1", "trainable": true}}, {"class_name": "MyLayerDenseDropout", "config": {"name": "my_layer_dense_dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": 0}}, {"class_name": "MyLayerDense", "config": {"name": "my_layer_dense_2", "trainable": true, "output_dim": 10}}], "build_input_shape": [null, 28, 28, 2]}, "keras_version": "2.2.4", "backend": "tensorflow"}